# Series

In [1]:
import numpy as np
import pandas as pd

In [21]:
obj1 = pd.Series([12,45,67,54,13,43,25,77] ,
                 index = ['a' , 'b' , 'c' , 'd' ,'e', 'f' , 'g' , 'h'])

In [28]:
12 in obj1.values

True

In [11]:
obj1

a    12
b    45
c    67
d    54
e    13
f    43
g    25
h    77
dtype: int64

In [12]:
obj1[['b' , 'd' , 'g' , 'a']]

b    45
d    54
g    25
a    12
dtype: int64

In [13]:
obj1>25

a    False
b     True
c     True
d     True
e    False
f     True
g    False
h     True
dtype: bool

In [14]:
obj1[obj1>25]

b    45
c    67
d    54
f    43
h    77
dtype: int64

In [15]:
obj1[obj1<25]

a    12
e    13
dtype: int64

In [19]:
a = obj1 * 2
a

a     24
b     90
c    134
d    108
e     26
f     86
g     50
h    154
dtype: int64

In [20]:
obj1

a    12
b    45
c    67
d    54
e    13
f    43
g    25
h    77
dtype: int64

In [17]:
obj1 + 3

a    15
b    48
c    70
d    57
e    16
f    46
g    28
h    80
dtype: int64

In [22]:
np.exp(obj1)

a    1.627548e+05
b    3.493427e+19
c    1.252363e+29
d    2.830753e+23
e    4.424134e+05
f    4.727839e+18
g    7.200490e+10
h    2.758513e+33
dtype: float64

In [31]:
np.sqrt(obj1)

a    3.464102
b    6.708204
c    8.185353
d    7.348469
e    3.605551
f    6.557439
g    5.000000
h    8.774964
dtype: float64

In [23]:
'f' in obj1

True

In [24]:
obj1.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

In [26]:
obj1.values

array([12, 45, 67, 54, 13, 43, 25, 77], dtype=int64)

In [29]:
obj1

a    12
b    45
c    67
d    54
e    13
f    43
g    25
h    77
dtype: int64

In [30]:
45 in obj1

False

# DataFrames

In [33]:
dates = pd.date_range('2019-07-01' , '2019-07-08')
dates

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-06', '2019-07-07', '2019-07-08'],
              dtype='datetime64[ns]', freq='D')

In [34]:
obj = pd.Series([34,56,89,99,90,65,23,10] , index = dates)
obj

2019-07-01    34
2019-07-02    56
2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
2019-07-07    23
2019-07-08    10
Freq: D, dtype: int64

In [35]:
obj2 = pd.Series([45,66,78,55,12,34,89,98] , index = dates)
obj2

2019-07-01    45
2019-07-02    66
2019-07-03    78
2019-07-04    55
2019-07-05    12
2019-07-06    34
2019-07-07    89
2019-07-08    98
Freq: D, dtype: int64

In [37]:
money = pd.DataFrame({'Monday':obj , 'Tuesday':obj2})
money

            Monday  Tuesday
2019-07-01      34       45
2019-07-02      56       66
2019-07-03      89       78
2019-07-04      99       55
2019-07-05      90       12
2019-07-06      65       34
2019-07-07      23       89
2019-07-08      10       98

In [40]:
ab = money['Monday']
ab

2019-07-01    34
2019-07-02    56
2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
2019-07-07    23
2019-07-08    10
Freq: D, Name: Monday, dtype: int64

In [41]:
ab['2019-07-03':'2019-07-06 ']

2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
Freq: D, Name: Monday, dtype: int64

In [42]:
diff = money.Monday - money.Tuesday
diff

2019-07-01   -11
2019-07-02   -10
2019-07-03    11
2019-07-04    44
2019-07-05    78
2019-07-06    31
2019-07-07   -66
2019-07-08   -88
Freq: D, dtype: int64

In [43]:
mult = money.Monday * money.Tuesday
mult

2019-07-01    1530
2019-07-02    3696
2019-07-03    6942
2019-07-04    5445
2019-07-05    1080
2019-07-06    2210
2019-07-07    2047
2019-07-08     980
Freq: D, dtype: int64

In [53]:
money['Wednesday'] = diff
money['Thursady'] = mult

In [54]:
money

            Monday  Tuesday  Wednesday  Thursady
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-03      89       78         11      6942
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080
2019-07-06      65       34         31      2210
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [55]:
money.Wednesday['2019-07-03' : '2019-07-07']

2019-07-03    11
2019-07-04    44
2019-07-05    78
2019-07-06    31
2019-07-07   -66
Freq: D, Name: Wednesday, dtype: int64

In [58]:
money.iloc[-2]

Monday         23
Tuesday        89
Wednesday     -66
Thursady     2047
Name: 2019-07-07 00:00:00, dtype: int64

In [61]:
money.loc['2019-07-01']

Monday         34
Tuesday        45
Wednesday     -11
Thursady     1530
Name: 2019-07-01 00:00:00, dtype: int64

In [63]:
money.Wednesday[money.Wednesday<0]

2019-07-01   -11
2019-07-02   -10
2019-07-07   -66
2019-07-08   -88
Name: Wednesday, dtype: int64

In [64]:
money[money.Wednesday<0]

            Monday  Tuesday  Wednesday  Thursady
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [65]:
money

            Monday  Tuesday  Wednesday  Thursady
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-03      89       78         11      6942
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080
2019-07-06      65       34         31      2210
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [67]:
money.iloc[[0,1,-1]].Wednesday

2019-07-01   -11
2019-07-02   -10
2019-07-08   -88
Name: Wednesday, dtype: int64

In [69]:
money.Wednesday[[0,1,-1]]

2019-07-01   -11
2019-07-02   -10
2019-07-08   -88
Name: Wednesday, dtype: int64

In [70]:
money.head()

            Monday  Tuesday  Wednesday  Thursady
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-03      89       78         11      6942
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080

In [71]:
money.tail()

            Monday  Tuesday  Wednesday  Thursady
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080
2019-07-06      65       34         31      2210
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [76]:
money.head(2).Monday

2019-07-01    34
2019-07-02    56
Freq: D, Name: Monday, dtype: int64

In [79]:
q = pd.Series([2,4,6,65,32] , pd.RangeIndex(start = 0 , stop = 10\
                                            , step = 2))
q

0     2
2     4
4     6
6    65
8    32
dtype: int64

In [82]:
data  = {"name":["Ali", "Siddiq", "Rehan"], "age":[23,45,56], "per":[90,78,89]}
data = pd.DataFrame(data)
data

     name  age  per
0     Ali   23   90
1  Siddiq   45   78
2   Rehan   56   89

In [93]:
data['age2']=np.random.randint(20,30,3)

In [94]:
data

     name  age  per  age2
0     Ali   23   90    50
1  Siddiq   45   78    50
2   Rehan   56   89    50

In [101]:
data = {
        "Ai for EveryOne":[78,89,78,76,49,90,34,76,98,100],
          "Python":       [74,73,45,89,87,84,82,81,86,37],
           "DeepLearning":[89,85,82,50,89,96,92,78,63,64]}
name = ["Ali", "Siddiq", "Rehan","Asad",'Ahmed', "Fahad", 'Saad', 'Akmal', 'Babar',"Hassan"]
data = pd.DataFrame(data,name)
data

        Ai for EveryOne  Python  DeepLearning
Ali                  78      74            89
Siddiq               89      73            85
Rehan                78      45            82
Asad                 76      89            50
Ahmed                49      87            89
Fahad                90      84            96
Saad                 34      82            92
Akmal                76      81            78
Babar                98      86            63
Hassan              100      37            64

In [102]:
data["Total"]=data["Ai for EveryOne"]+data['Python']+data['DeepLearning']

In [103]:
data

        Ai for EveryOne  Python  DeepLearning  Total
Ali                  78      74            89    241
Siddiq               89      73            85    247
Rehan                78      45            82    205
Asad                 76      89            50    215
Ahmed                49      87            89    225
Fahad                90      84            96    270
Saad                 34      82            92    208
Akmal                76      81            78    235
Babar                98      86            63    247
Hassan              100      37            64    201

In [104]:
data["perc"]=data["Total"]/3

In [105]:
data

        Ai for EveryOne  Python  DeepLearning  Total       perc
Ali                  78      74            89    241  80.333333
Siddiq               89      73            85    247  82.333333
Rehan                78      45            82    205  68.333333
Asad                 76      89            50    215  71.666667
Ahmed                49      87            89    225  75.000000
Fahad                90      84            96    270  90.000000
Saad                 34      82            92    208  69.333333
Akmal                76      81            78    235  78.333333
Babar                98      86            63    247  82.333333
Hassan              100      37            64    201  67.000000

In [109]:
data["Result"]=[ "Fails" if percentage<70 else "Pass" for percentage in data["perc"]]

In [110]:
data

        Ai for EveryOne  Python  DeepLearning  Total       perc Result
Ali                  78      74            89    241  80.333333   Pass
Siddiq               89      73            85    247  82.333333   Pass
Rehan                78      45            82    205  68.333333  Fails
Asad                 76      89            50    215  71.666667   Pass
Ahmed                49      87            89    225  75.000000   Pass
Fahad                90      84            96    270  90.000000   Pass
Saad                 34      82            92    208  69.333333  Fails
Akmal                76      81            78    235  78.333333   Pass
Babar                98      86            63    247  82.333333   Pass
Hassan              100      37            64    201  67.000000  Fails

In [122]:
z = zip(data["Ai for EveryOne"],data['Python'],data["DeepLearning"])

In [125]:
data["result1"]=["Pass" if ((ai>70) & (py>70) & (dl>70)) else "Fail" for ai,py,dl in zip(data["Ai for EveryOne"],data['Python'],data["DeepLearning"])]

In [126]:
data

        Ai for EveryOne  Python  DeepLearning  Total       perc Result result1
Ali                  78      74            89    241  80.333333   Pass    Pass
Siddiq               89      73            85    247  82.333333   Pass    Pass
Rehan                78      45            82    205  68.333333  Fails    Fail
Asad                 76      89            50    215  71.666667   Pass    Fail
Ahmed                49      87            89    225  75.000000   Pass    Fail
Fahad                90      84            96    270  90.000000   Pass    Pass
Saad                 34      82            92    208  69.333333  Fails    Fail
Akmal                76      81            78    235  78.333333   Pass    Pass
Babar                98      86            63    247  82.333333   Pass    Fail
Hassan              100      37            64    201  67.000000  Fails    Fail

In [114]:
x = [1,2,3,4,5]
y = [11,22,33,44,55]


z  = zip(x,y)

for q  in z:
    print(q)

(1, 11)
(2, 22)
(3, 33)
(4, 44)
(5, 55)